run/discInGravity/baseCase_floatStepper/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "system";
    object          controlDict;
}

application     floatStepper;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         3;

deltaT          0.005;

writeControl    adjustable;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression no;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;

maxAlphaCo      0.5;

maxDeltaT       1;

functions
{
    floaterMotion
    {
        type            floaterStateWriter;
        libs            ( floaterStateWriter );
        writeControl    timeStep;
        writeInterval   1;
        classicWriteFormat false;
        bodyName body;
    }

    addedMass
    {
        type           addedMassWriter;
        libs           (addedMassWriter);
        writeControl   timeStep;
        writeInterval  1;
        bodyName body;
    }
}


// ************************************************************************* //
